{
    "sectionTitle": "Mi",
    "sectionTitleAccent": "Trayectoria",
    "sectionDescription": "Explora mi experiencia profesional y académica a través del tiempo",
    "resultsText": {
        "showingAll": "Mostrando todas las experiencias",
        "showingFiltered": "Mostrando",
        "of": "de",
        "experiencesLabel": "experiencias"
    },
    "noResultsFound": {
        "title": "No se encontraron experiencias",
        "description": "Intenta ajustar los filtros o el término de búsqueda"
    },
    "cardLabels": {
        "technologies": "Tecnologías:",
        "keyAchievements": "Logros clave:",
        "links": "Enlaces:"
    },
    "experiences": [
        {
            "id": "exp-009",
            "title": "Desarrollador Full Stack",
            "organization": "TechCorp Solutions",
            "description": "Desarrollo de aplicaciones web completas utilizando tecnologías modernas para mejorar la experiencia del usuario y optimizar procesos empresariales.",
            "eventType": "work",
            "period": {
                "start": "2023-01",
                "end": "2024-06"
            },
            "location": "Remoto",
            "workTime": "Tiempo Completo",
            "role": "Desarrollador Full Stack",
            "shortDescription": "Desarrollo de aplicaciones web completas utilizando tecnologías modernas para mejorar la experiencia del usuario y optimizar procesos empresariales.",
            "keyAchievements": [
                "Optimización del rendimiento de la aplicación en un 40%",
                "Implementación de arquitectura microservicios",
                "Liderazgo de equipo de 3 desarrolladores junior",
                "Automatización de procesos de despliegue con CI/CD"
            ],
            "technologies": [
                "React",
                "Node.js",
                "PostgreSQL",
                "Docker",
                "AWS"
            ],
            "links": [
                {
                    "title": "Proyecto Principal",
                    "url": "https://github.com/usuario/proyecto"
                }
            ],
            "expanded": false
        },
        {
            "id": "exp-008",
            "title": "Certificación AWS Solutions Architect",
            "organization": "Amazon Web Services",
            "description": "Certificación en arquitectura de soluciones en la nube de Amazon Web Services, enfocada en diseño de sistemas escalables y seguros.",
            "eventType": "certification",
            "period": {
                "start": "2023-03",
                "end": "2023-05"
            },
            "location": "Online",
            "workTime": "Tiempo Parcial",
            "role": "Estudiante",
            "shortDescription": "Certificación en arquitectura de soluciones en la nube de Amazon Web Services, enfocada en diseño de sistemas escalables y seguros.",
            "keyAchievements": [
                "Dominio de servicios AWS principales (EC2, S3, RDS, Lambda)",
                "Diseño de arquitecturas altamente disponibles",
                "Implementación de mejores prácticas de seguridad",
                "Optimización de costos en la nube"
            ],
            "technologies": [
                "AWS",
                "CloudFormation",
                "IAM",
                "VPC",
                "Lambda"
            ],
            "links": [
                {
                    "title": "Certificado",
                    "url": "https://aws.amazon.com/verification"
                }
            ],
            "expanded": false
        },
        {
            "id": "exp-007",
            "title": "Aplicación de Gestión de Inventarios",
            "organization": "Proyecto Freelance",
            "description": "Desarrollo de una aplicación completa para gestión de inventarios de una empresa mediana, incluyendo dashboard administrativo y API REST.",
            "eventType": "project",
            "period": {
                "start": "2022-08",
                "end": "2023-02"
            },
            "location": "Freelance",
            "workTime": "Proyecto",
            "role": "Desarrollador Full Stack",
            "shortDescription": "Desarrollo de una aplicación completa para gestión de inventarios de una empresa mediana, incluyendo dashboard administrativo y API REST.",
            "keyAchievements": [
                "Reducción del tiempo de gestión de inventario en 60%",
                "Implementación de sistema de reportes automáticos",
                "Integración con sistemas de facturación externos",
                "Desarrollo de aplicación móvil complementaria"
            ],
            "technologies": [
                "Next.js",
                "Express.js",
                "MongoDB",
                "React Native",
                "Chart.js"
            ],
            "links": [
                {
                    "title": "Demo",
                    "url": "https://demo-inventario.com"
                },
                {
                    "title": "GitHub",
                    "url": "https://github.com/usuario/inventario-app"
                }
            ],
            "expanded": false
        },
        {
            "id": "exp-003",
            "title": "Segundo Semestre de Ingeniería en Sistemas Computacionales",
            "organization": "ITESO - Universidad Jesuita de Guadalajara - 2° Semestre",
            "description": "En el segundo semestre cursé materias clave como 'Fundamentos de Ciencias Computacionales', 'Interconexión de Redes' y 'Programación Estructurada'. En Fundamentos de Ciencias Computacionales aprendí sobre lógica, conjuntos, funciones, relaciones, conteo y grafos, desarrollando habilidades para modelar y resolver problemas mediante herramientas matemáticas discretas. En Interconexión de Redes utilicé Cisco Packet Tracer para crear y configurar redes virtuales, practicar comandos de red y planificar topologías con switches y routers. En Programación Estructurada trabajé con el lenguaje C usando MingW y Eclipse, aprendiendo desde la sintaxis básica, declaración de variables, control de flujo, funciones, recursión, manejo de arreglos, cadenas, estructuras y uniones, hasta la representación de datos en memoria y conceptos fundamentales de la programación modular.",
            "eventType": "education",
            "period": {
                "start": "2021-01",
                "end": "2021-05"
            },
            "location": "Guadalajara, Jalisco",
            "workTime": "Horario Escolar",
            "role": "Estudiante",
            "shortDescription": "Segundo semestre enfocado en fundamentos matemáticos, redes y programación estructurada en C.",
            "keyAchievements": [
                "Modelado y resolución de problemas con lógica, conjuntos y grafos",
                "Configuración de redes virtuales y topologías con Cisco Packet Tracer",
                "Desarrollo de programas en C aplicando estructuras, funciones y arreglos",
                "Comprensión de la representación de datos en memoria y modularidad",
                "Aplicación de conceptos de control de flujo, recursión y manejo de cadenas"
            ],
            "technologies": [
                "C",
                "MingW",
                "Eclipse",
                "Cisco Packet Tracer",
                "Matemáticas Discretas"
            ],
            "links": [],
            "expanded": false
        },
        {
            "id": "exp-002",
            "title": "Inicio de Estudios Universitarios",
            "organization": "ITESO - Universidad Jesuita de Guadalajara - 1° Semestre",
            "description": "Después de mi año sabático, decidí inscribirme en ITESO en la carrera de Ingeniería en Sistemas Computacionales. Durante el primer semestre, tuve mis primeras materias relacionadas con la programación, utilizando PSeInt para aprender a estructurar instrucciones y entender la lógica detrás de los algoritmos. Posteriormente, el primer lenguaje de programación que aprendí fue Python, para lo cual instalé el entorno de Python y utilicé el IDE PyCharm Edu. En la materia de 'Algoritmos y programación' aprendimos los conceptos básicos como operadores lógicos, sintaxis, condicionales, variables y estructuras simples en Python. Además, cursé la materia 'Introducción a redes computacionales', donde conocí los diferentes tipos y categorías de cables, tecnologías de red y el modelo OSI.",
            "eventType": "education",
            "period": {
                "start": "2020-08",
                "end": "2020-12"
            },
            "location": "Guadalajara, Jalisco",
            "workTime": "Horario Escolar",
            "role": "Estudiante",
            "shortDescription": "Ingreso a ITESO en Ingeniería en Sistemas Computacionales, aprendiendo fundamentos de programación con PSeInt y Python, y conceptos básicos de redes.",
            "keyAchievements": [
                "Aprendizaje de lógica de programación con PSeInt",
                "Primeros pasos en Python utilizando PyCharm Edu",
                "Instalación y configuración de entornos de desarrollo",
                "Comprensión de operadores, variables y estructuras básicas en Python",
                "Introducción a redes: tipos de cables, categorías y modelo OSI"
            ],
            "technologies": [
                "PSeInt",
                "Python",
                "PyCharm Edu",
                "Redes"
            ],
            "links": [],
            "expanded": false
        },
        {
            "id": "exp-001",
            "title": "Ayudante General en Reparación y Soporte Técnico",
            "organization": "SEI - Soluciones y Equipamiento en Informática ",
            "description": "Después de graduarme de la preparatoria, tomé un año sabático para reflexionar sobre mi futuro académico y profesional. Durante ese periodo, trabajé como ayudante general en una microempresa dedicada a la reparación de laptops, instalación de redes y soporte técnico para pequeñas/medianas empresas. Mi labor incluyó la instalación de drivers y software, limpieza y mantenimiento de hardware (como cambio de pasta térmica y eliminación de polvo), así como la reparación básica de impresoras y la instalación de componentes. Esta experiencia me permitió conocer el entorno laboral real, desarrollar habilidades técnicas y entender mejor el funcionamiento de los equipos informáticos.",
            "eventType": "work",
            "period": {
                "start": "2019-09",
                "end": "2020-08"
            },
            "location": "Presencial, Jalisco",
            "workTime": "Medio Tiempo",
            "role": "Ayudante General",
            "shortDescription": "Trabajo como ayudante general en reparación de laptops, instalación de redes y mantenimiento de hardware y software en una microempresa de servicios informáticos.",
            "keyAchievements": [
                "Instalación de drivers y software en equipos de cómputo",
                "Mantenimiento y limpieza de hardware (pasta térmica, polvo, archivos temporales)",
                "Reparación básica de impresoras y equipos",
                "Instalación de componentes y redes para pequeñas empresas",
                "Adquisición de experiencia laboral en el sector tecnológico"
            ],
            "technologies": [
                "Windows",
                "Ubuntu",
                "Herramientas de limpieza de hardware",
                "Instaladores de drivers",
                "Instalacion de software",
                "Redes LAN/WAN",
                "Impresoras"
            ],
            "links": [],
            "expanded": false
        },
        {
            "id": "exp-000",
            "title": "Carrera Técnica en Programación",
            "organization": "CBTis 49 - Centro de Estudios Tecnológicos Industrial y de Servicios No. 49",
            "description": "Durante mi formación en el CBTis 49, tuve mi primer acercamiento formal a la programación y las tecnologías. Aprendí los fundamentos con HTML y C#, desarrollé proyectos básicos con Microsoft Access y Pseint, y realicé mis primeras prácticas en emuladores de Android Studio. También monté una tienda en línea con PrestaShop y exploré herramientas visuales como Adobe Dreamweaver. Esta etapa fue clave para despertar mi interés por el desarrollo de software.",
            "eventType": "education",
            "period": {
                "start": "2016-08",
                "end": "2019-08"
            },
            "location": "Ocotlán, Jalisco",
            "workTime": "Horario Escolar",
            "role": "Estudiante",
            "shortDescription": "Primer contacto con la programación y tecnologías, aprendiendo fundamentos y herramientas que marcaron el inicio de mi trayectoria en el desarrollo de software.",
            "keyAchievements": [
                "Aprendizaje de fundamentos de programación con HTML y C#",
                "Desarrollo de proyectos básicos con Microsoft Access y Pseint",
                "Primeras prácticas en emuladores de Android Studio",
                "Montaje de e-commerce con PrestaShop y hosting gratuito",
                "Exploración de herramientas visuales como Adobe Dreamweaver"
            ],
            "technologies": [
                "HTML",
                "Microsoft Access",
                "C#",
                "Pseint",
                "Android Studio",
                "PrestaShop",
                "Adobe Dreamweaver"
            ],
            "links": [],
            "expanded": false
        }
    ]
}