{
    "sectionTitle": "Mis",
    "sectionTitle2": "hobbies",
    "sectionDescription": "Las actividades que me inspiran y mantienen mi creatividad fuera del código",
    "hobbies": [
        {
            "id": 1,
            "title": "Videojuegos",
            "description": "Los videojuegos no solo son mi forma de relajarme y distraerme tras un día intenso, también me inspiran a resolver problemas difíciles y a la toma de desiciones. Diseñar interfaces intuitivas. Me motiva analizar cómo se entretiene y se guía al usuario, buscando siempre aplicar esas experiencias lúdicas en el desarrollo de productos digitales.",
            "icon": "FaGamepad",
            "category": "Entretenimiento",
            "tags": [
                "FPS",
                "Shooter",
                "Battle Royale",
                "Cooperativo",
                "Online",
                "VR",
                "Ritmo / Música",
                "Indie",
                "Competitivo",
                "Supervivencia",
                "Acción",
                "RPG",
                "Mundo Abierto"
            ]
        },
        {
            "id": 2,
            "title": "Música",
            "description": "La música es mi compañera indispensable durante el desarrollo. Escucho todo tipo de géneros, en español e inglés, lo cual también me ayuda a mejorar mi pronunciación y comprensión auditiva en inglés. La variedad musical me aporta energía, concentración y creatividad para programar.",
            "icon": "FaMusic",
            "category": "Arte",
            "tags": [
                "Rock",
                "Pop",
                "Pop-Rock",
                "Electrónica",
                "Lo-fi Hip Hop",
                "Indie",
                "Alternativo",
                "Música Mexicana",
                "Música en inglés",
                "Y más..."
            ]
        },
        {
            "id": 3,
            "title": "Deporte",
            "description": "Practicar deportes es una de mis mayores fuentes de distracción y bienestar. Disfruto especialmente de actividades que requieren el uso de las manos, como el baloncesto, donde la colaboración en equipo es fundamental. El deporte me ayuda a despejar la mente, fortalecer lazos sociales y mantenerme saludable.",
            "icon": "FaBasketballBall",
            "category": "Salud",
            "tags": [
                "Baloncesto",
                "Volleyball",
                "Deportes de equipo",
                "Competencia",
                "Trabajo en equipo",
                "Diversión",
                "Socialización"
            ]
        },
        {
            "id": 4,
            "title": "Ejercicio",
            "description": "Mantenerme activo es esencial para mi bienestar físico y mental. El ejercicio, ya sea en el gimnasio, caminando o aceptando retos como andar en bicicleta, me ayuda a liberar estrés, transformar la energía negativa en positiva y mantener una actitud optimista frente a los desafíos diarios.",
            "icon": "FaDumbbell",
            "category": "Salud",
            "tags": [
                "Gimnasio",
                "Caminatas",
                "Disciplina",
                "Bienestar",
                "Ciclismo"
            ]
        }
    ]
}